/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Graph Unary Operation']=Kx(


detail('图（一元运算）',Table([ZLR('名称 记法 定义 性质')],[


	ZLR('底图\n________有向图转成的无向图（有向图的边都看成无向边）____','','____'),

	ZLR('结点的出度\n引出次数____\\deg^+(v)____以v为始点的边数____','','____'),
	ZLR('结点的入度\n引入次数____\\deg^-(v)____以v为终点的边数____','','____'),
	ZLR('结点的度数\n次数____\\deg(v)____\\deg(v)='+piece([['\\deg^+(v)+\\deg^-(v)','有向图'],['与v关联的边数','无向图']])+'____'+
		kul(['\\deg(孤立结点)=0',
			'\\deg为奇数的结点数是偶数',
			'无向图(n个结点,m条边) '+sum('i',1,'n','\\deg(v_i)','','')+'=2m',
			'任何有向图，'+sum('i',1,'n','\\deg^+(v_i)','','')+'='+sum('i',1,'n','\\deg^-(v_i)','',''),
			'任何有向完全图，'+sum('i',1,'n','\\deg^+(v_i^2)','','')+'='+sum('i',1,'n','\\deg^-(v_i^2)','',''),
			'无向简单图（n个结点，n≥2）至少有2个结点\\deg相等',
			'无向简单图（n个结点，边数m=n+1）至少有1个结点\\deg≥3',
			kxA(['无向图中最小度数 ≝ δ(G)，','最大度数 ≝ Δ(G) ，','有δ(G) ≤'+frac('2m','n','')+'≤ Δ(G)']),
		]),'','____'),
	ZLR('子图________结点集是子集，边集是子集的图____','','____'),
	ZLR('真子图________不等于父图的子图____','','____'),
	ZLR('生成子图________结点集保持不变（边可能减少）的子图____','','____'),
	ZLR('边集E\'导出的子图____G[E\']____边集为E\'，无孤立结点的子图____','','____'),
	ZLR('结点集V\'导出的子图____G[V\']____结点集为V\'，涉及的边仍保留的子图____','','____'),
	ZLR('补图____'+kxo('G')+'____完全图删边得到（结点集不变）____'+kul(['n-E',kxo(kxo('G'))+'=G']),'','____'),


],'wiki').replace(/\n/g,br))

);