/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Graph Type']=Kx(


detail('图类型',Table([ZLR('名称 记法 定义 性质')],[
	
	ZLR('图\nGraph____'+khrA(['G','< V,E,Φ >','结点数n,边数m'])+'____由点集、边集、边点关系函数构成','','____'),

	ZLR('有向图________只含有向边（弧） < a,b > ','','____'),
	ZLR('无向图________只含无向边（棱）(a,b)','','____'),
	ZLR('混合图________既有有向边，又有无向边[a,b]','','____'),

	ZLR('零图________全是孤立结点','','____'),
	ZLR('多重图________'+kxA(['含平行边（多个自回路也算，','且有向图要区分方向）','平行边的边数称为重数']),'','____'),
	ZLR('线图________不含平行边','','____'),

	ZLR('简单图________无自回路（一条边始点终点相同）的线图________'+
		'有向简单图 (n个结点)最多有n(n-1)条边','','____'),

	ZLR('平凡图________只有1个结点的简单图','','____'),

	ZLR('赋权图____ < V,E,f,g > ____结点或边有权重信息','','____'),

	ZLR('正则图\n$k-$正则图________结点deg均相同（都为k）的无向图','','____'),
	ZLR('Petersen图\n________是一个3-正则图','','____'),

	ZLR('完全图\n____K____n____任意两点间有边（有向图，要有两条）________'+kul([
		'无向完全图 (n个结点)有'+frac(1,2,'')+'n(n-1)条边'
		
		
		]),'','____'),

	ZLR('自补图\n________与补图同构的无向图________'+
		'自补图有4k或4k+1个结点'
		,'','____'),



],'wiki').replace(/\n/g,br))

);