/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Prime Type']=Kx(

detail('素数（按自身数学性质）',Table([ZLR('名称 定义(满足条件) 第n项 前n项 性质')],[


	['Wilson素数',['$p^2|(p-1)!+1$',SCtv('notes','由Wilson定理得知$p|(p-1)!+1$')].join(br),'','5,13,563,（目前仅知3个）'.split(',').join(br),
		ul(['',
			ol(['是否存在其他Wilson素数？（如有，则大于 $2×10^{13}$）','是否存在无限多Wilson素数？（一般猜想是有限个）'],'unknown')
		])
		],

	['Wieferich素数',['$p^2|2^{p-1}-1$',SCtv('notes','由费马小定理得知$p|2^{p-1}-1$')].join(br),'','1093,3511,（目前仅知两个）'.split(',').join(br),
		ul([''
			
		])
		],

	['全循环节素数____Full repetend____Full reptend____Proper____Long',['$1/p循环节长度是p-1$',''].join(br),'',
		'7,17,19,23,29,47,59,61,97,109,113,131,149,167,179,181,193,223,229,233,257,263,269,313,337,367,379,383,389,419,433,461,487,491,499,503,509,541,571,577,593,619,647,659,701,709,727,743,811,821,823,857,863,887,937,941,953,971,977,983,⋯'.split(',').join(br),
		ul(['',
		]),
		],


	['正则素数____Regular',['不能整除任何Bernoulli数的分子'].join(br),'',
		'2,3,17,137,227,977,1187,1493,⋯,'.split(',').join(br),
		ul(['',
			ol(['有无限多正则素数？约占所有素数的 $e^{-1/2}≈60.65\\%$'+scbox('Siegel猜想','brad bold')],'unknown')
		])],

	['非正则素数____Irregular',['能整除某个Bernoulli数的分子'].join(br),'',
		'37,59,67,101,103,131,149,157,233,257,263,271,283,293,307,311,347,353,379,389,401,409,421,433,461,463,467,491,523,541,547,557,577,587,593,⋯,'.split(',').join(br),
		ul(['有无限多$4n+3$形式的非正则素数（Jensen）',
			'有无限多非$mT±1（T>6）$形式的非正则素数（Metsänkylä）',
		])],

	['Wolstenholme素数',['$p|B_{p-1}$的分子','其中$B$表示Bernoulli数'].join(br),'',
		('16843,2124679,(小于$10^9$仅知这两个),⋯,').split(',').join(br),
		ul(['Wolstenholme素数是非正则素数',
			ol(['是否无限多？'],'unknown')
		])],


	['Wall-Sun-Sun素数____Fibonacci-Wieferich',[ksc(mod('L_p',1,'p^2','','','')),'其中$L$表示Lucas数'].join(br),'',
		''.split(',').join(br),
		ul(['',
			ol(['是否存在？'],'unknown')
		])],


	['Ramanujan素数',['最小的使得$π(x)-π(x/2)≥n$','对所有$x≥p$成立'].join(br),'$R_n$',
		'2,11,17,29,41,⋯,'.split(',').join(br),
		ul(['',
		])],

	['Pillai素数',[ksc('存在n使得'+mod('n!',-1,'p','','','')),ksc(mod('p',1,'n',1,'',''))].join(br),'',
		'23,29,59,61,67,71,79,83,109,137,139,149,193,⋯,'.split(',').join(br),
		ul(['',
		])],

],'TBrc').replace(/____/g,br))+

detail('素数（按表达式）',Table([ZLR('名称 定义(满足条件) 第n项 前n项 性质')],[

	['梅森素数____Mersenne Prime',ksc(kxA(['素数M_p=2^p-1','其中p是素数'])),'','3,7,31,127,8191,131071,524287,2147483647,2305843009213693951,⋯,迄今发现49个梅森素数'.split(',').join(br),
		ul(['所有$2^k-1$形式的素数____一定是梅森素数（即$k$一定是素数）____'+SCtv('prov','因为$2^{pq}-1$可以因式分解'),
		'所有$a^k-1形式的素数（k>1）$____一定是梅森素数（即$a$一定是2）',
		'偶完美数与梅森素数一一对应____'+scbox('Euclid–Euler定理','bold brad'),
		'$Δ>0$, Legendre符号'+ksc(lrp('',frac('Δ','M_p',''),'','')+'=-1')+'____且在二次域'+
		ksc(kxc('Q')+'('+root('Δ','','','')+')')+
		//'$\\mathbb {Q}( \\sqrt {Δ})$'+
		'中____有1个单位数$ε满足N(ε)=-1$____则$M_p是素数 ⇔ '+mod('ε^{2p-1}+ \\bar ε^{2p-1}',0,'M_p','','','')+'$____'+
		scbox('Lucas','bold brad'),
		'$M_p是素数（p>2）⇔ M_p | L_{p-2}$____其中数列$L_0=4, L_{n+1}=L_n^2-2 \\bmod M_p$'+br+
		scbox('Lucas-Lehmer测试LLT','bold brad'),
		'$q^2|M_p ⇒ '+mod('2^{q-1}',1,'q^2','','','')+'$____'+scbox('Warren','bold brad'),
		'$当q<6⋅10^9时，'+mod('2^{q-1}',1,'q^2','','','')+'$____无$q=1093或3511$（已知的Wieferich素数）之外的解____'+scbox('Lehmer','bold brad'),
		ol(['是否存在其他梅森素数？','是否存在含平方因子的梅森数？','梅森素数表中$M_{27}～M_{31}$之间____是否存在其它梅森素数？'],'unknown')
		])],
		
	['双重梅森素数____Double Mersenne Prime',ksc(kxA(['素数M_{M_p}=2^{2^p-1}-1','其中p是素数'])),'','$p=2,3,5,7$',
		ul(['',
		ol(['是否存在其他双重梅森素数？','接下来最可能是双重梅森素数是$M_{M_{61}}$'],'unknown')
		])],



	['费马素数____Fermat',['素数满足形式：'+ksc(msups([2,2,'n'],'')+'+1')].join(br),'','3,5,17,257,65537'.split(',').join(br),
		ul(['所有'+ksc(kxA(['2^k+1形式（k>0）的素数','一定是费马素数（即k一定是2的幂）']))+br
			+SCtv('prov',ksc(mod('2^k+1 = (2^a)^b+1','(-1)^b+1 = 0','2^a+1'))),
			ksc(kxA(['n>0时，费马数F_n是素数','⇔'+
				mod('3^{'+frac('F_n-1',2,'t')+'}',-1,'F_n','','',''),
				'⇔'+
				'F_n |'+msups([3,2,'2^n-1'],'')+'+1']))+br
			+scbox('Pépin测试','bold brad')+
			ksc(kxA(['事实上3可以用其他数字b代替，','⇔只有有限个n，使得雅克比符号'+lrp('',frac('b','F_n',''),'','')+'=1'])),

		ksc(kxA(['与正N边形能尺规作图的关系：','N=2^kF_0⋯F_j','其中F_i是不同的费马素数']))+br
			+scbox('Gauss, Wantzel','bold brad')+br+
		ksc(kxA(['即N素因子只含有2的幂和不同的费马素数，','也即此时\\sin ('+frac('kπ','N','t')+'), \\cos ('+frac('kπ','N','t')+')','可通过加减乘除开方得到'])),
		'费马素数无法表达成两个数的奇素数幂之差',
		'前5个费马数都是素数','其他已知费马数（$F_5,⋯,F_{32}$）都是合数',
		'前12个费马数得到完全因式分解','$F_{20}，F_{24}$素因子未知',
		'已知300多个费马合数'+href(H+'www.prothsearch.com/fermat.html','最新进展'),
		ol(['是否存在其他费马素数？','是否存在无限多费马素数、费马合数？','是否存在含平方因子的费马数？'],'unknown')
		])],


	['Wagstaff素数',['素数满足形式：'+ksc(frac('2^p+1',3,'')),'其中$p$是奇素数'].join(br),'','$p=$'+br+'3,5,7,11,13,17,19,23,31,⋯'.split(',').join(br),
		ul(['',

		])],

	['Proth素数',['素数满足形式：$k⋅2^p+1$'].join(br),'',
			('3,5,13,17,41,97,113,193,241,257,353,449,577,641,673,769,929,1153,1217,1409,1601,2113,2689,2753,3137,3329,3457,4481,4993,6529,7297,7681,7937,9473,9601,9857,⋯,'+
			'$10223⋅2^{31172165}+1$（2016年已知最大,且是最大非梅森的素数）').split(',').join(br),
		ul(['$p$是Proth素数'+br+ksc(' ⇔ 存在a，使得'+mod('a^{'+frac('p-1',2,'t')+'}','-1','p','','',''))+br+
			scbox('Proth定理','bold brad')
		])],


	['阶乘素数____Factorial prime',ksc(kxA(['素数满足形式：n!±1'])),'','2,3,5,7,23,719,5039,39916801,⋯,'+br+
		'$n!−1是素数，当n=$'+br+('3,4,6,7,12,14,30,32,33,38,94,166,324,379,469,546,974,1963,3507,3610,6917,21480,34790,94550,103040,147855,208003,').split(',').join(br)+br+
		'$n!+1是素数，当n=$'+br+('0,1,2,3,11,27,37,41,73,77,116,154,320,340,399,427,872,1477,6380,26951,110059,150209').split(',').join(br),
		ul([
			'$n!周围至少有2n+1个连续合数，因为k|n!±k, 当2≤k≤n时$'
		])],

	['素数阶乘素数____Primorial prime',['素数满足形式：$p_n \\# ±1$','Euclid素数 $p_n \\# +1$','Kummer素数 $p_n \\# -1$'].join(br),'',
			('2,3,5,7,29,31,211,2309,2311,30029,200560490131,304250263527209,23768741896345550_,770650537601358309,⋯,$p_{1098133} \\# −1$,⋯').split(',').join(br),
		ul(['$p_n \\# −1是素数，当n=2,3,5,6,13,24,⋯$',
			'$p_n \\# +1是素数，当n=0,1,2,3,4,5,11,⋯$',
			ol(['是否存在无穷多Euclid素数 $p_n\\# +1$、Kummer素数 $p_n \\# -1？$'],'unknown')
		])],

	['Pythagorean素数',['素数满足形式：$4n+1$'].join(br),'',('5,13,17,29,37,41,53,61,73,89,97,101,109,113,⋯').split(',').join(br),
		ul(['',
		])],

	['Pierpont素数',ksc(kxA(['素数满足形式：2^u⋅3^v+1','其中u,v是非负数'])),'',
		('2,3,5,7,13,17,19,37,73,97,109,163,193,257,433,487,577,769,1153,1297,1459,2593,2917,3457,3889,10369,12289,17497,18433,39367,52489,65537,139969,147457,209953,331777,472393,629857,746497,786433,839809,995329,⋯,').split(',').join(br)
		+'$3×2^{7033641}+1$'+br+'⋯',
		ul(['$v=0, u>0 ⇒ u必须是2的幂，因此得到费马素数$',
			'$v>0 ⇒ u>0，因此得到6k+1形式素数$',
			ol(['是否存在无限多Pierpont素数？'],'unknown')
		])],


	['Quartan素数',['素数满足形式：$x^4+y^4$'].join(br),'',
		('2,17,97,257,337,641,881,⋯').split(',').join(br),
		ul(['$奇 ⇒ 满足形式16n+1，且x,y是1奇1偶$',
			ol(['是否存在无限多Quartan素数？'],'unknown')
		])],

	['Solinas素数',['素数满足形式：$2^a±2^b±1$'].join(br),'',
		('3,5,7,11,13,17,19,23,29,31,37,41,47,59,61,67,71,73,79,97,⋯').split(',').join(br),
		ul(['最小的非Solinas素数的奇素数是43',
			ol(['是否存在无限多Solinas素数？'],'unknown')
		])],

	['Cullen素数',['素数满足形式：$C_n=n⋅2^n+1$','推广的Cullen素数：','$nb_n+1$','其中$b < n+2$'].join(br),'',
		'$n=$'+br+('1,141,4713,5795,6611,18496,32292,32469,59656,90825,262419,361275,481899,1354828,6328548,6679881,⋯').split(',').join(br),
		ul(['$素数p=2n-1=8k-3（即n=4k-1） ⇒ p|C_n，即2n-1|n2^n+1$',
			'$奇素数p|C_{(2^k−k)(p−1)−k}$',
			ksc('素数p|'+piece([['C_{'+frac('p+1',2,'t')+'}','当'+lrp('',frac(2,'p',''),'','')+'=-1'],['C_{'+frac('3p-1',2,'t')+'}','当'+lrp('',frac(2,'p',''),'','')+'=1']])),
			ol(['是否存在无限多Cullen素数？','是否存在素数$p，满足C_p$也是素数？'],'unknown')
		])],

	['Woodall素数',['素数满足形式：$W_n=n⋅2^n-1$','推广的Woodall素数：','$nb_n-1$','其中$b < n+2$'].join(br),'',
		('7,23,383,32212254719,⋯,$W_{3752948}$,⋯').split(',').join(br),
		ul([
			ksc('素数p|'+piece([['W_{'+frac('p+1',2,'t')+'}','当'+lrp('',frac(2,'p',''),'','')+'=-1'],['W_{'+frac('3p-1',2,'t')+'}','当'+lrp('',frac(2,'p',''),'','')+'=1']])),
			ol(['是否存在无限多Woodall素数？','是否存在素数$p$，满足$W_p$也是素数？'],'unknown')
		])],

	['Cuban素数',ksc(kxA(['素数满足形式：'+frac('x^3-y^3','x-y','')+' = x^2+xy+y^2',
			'第1类：','满足x=y+1，','即','3y^2+3y+1','令y=n-1，','即','3n^2-3y+1','',
			'第2类：','满足x=y+2，','即','3y^2+6y+4','令y=n-1，','即','3n^2+1',
			])),'',
		('第1类：,7,19,37,61,127,271,331,397,547,631,919,1657,1801,1951,2269,2437,2791,3169,3571,4219,4447,5167,5419,6211,7057,7351,8269,9241,⋯,第2类：,13,109,193,433,769,1201,1453,2029,3469,3889,4801,10093,12289,13873,18253,20173,21169,22189,28813,37633,43201,47629,60493,63949,65713,69313,⋯').split(',').join(br),
		ul([''
		])],


	['Carol素数',ksc(kxA(['素数满足形式：(2^n-1)^2-2','4^n-2^{n+1}-1','M_{2n}-2^{n+1}','M_{2n}-M_{n+1}-1'])),'',
		'7,47,223,3967,16127,1046527,⋯,'.split(',').join(br)+'$n=253987$（第40个）'+br+'⋯',
		ul(['$n是3k+2$时，Carol数不是素数'
		])],

	['Kynea素数',ksc(kxA(['素数满足形式：(2^n+1)^2-2','4^n+2^{n+1}-1','4^n+M_{n+1}','M_{2n}+M_{n+1}+1'])),'',
		'7,23,79,1087,66047,263167,16785407,⋯,'.split(',').join(br)+'$n=281621$（第46个）'+br+'⋯',
		ul(['$n是3k+1$时，Kynea数不是素数'
		])],

	['Leyland素数',ksc(kxA(['素数满足形式：x^y+y^x','x≥y>1'])),'',
		'$x,y=$'+br+'3,2;9,2;15,2;21,2;31,2;24,5;56,3;32,15;⋯;3110,63;⋯;6753,5122;⋯;8656;2929;⋯'.split(';').join(br),
		ul([''
		])],
	['第2类Leyland素数',ksc(kxA(['素数满足形式：x^y-y^x','y>x>1'])),'',
		'7,17,79,431,58049,130783,162287,523927,2486784401,6102977801,8375575711,13055867207,83695120256591,375700268413577,2251799813682647,⋯'.split(',').join(br),
		ul([''
		])],

	['Thabit素数____321素数',['素数满足形式：'+zx('3⋅2^n-1')].join(br),'',
		'2,5,11,23,47,191,383,6143,786431,51539607551,824633720831,⋯'.split(',').join(br),
		ul([
			'与亲和数的关系：'+ksc(kxA(['3⋅2^n-1,3⋅2^{n-1}-1,9⋅2^{2n-1}-1都是素数',
			'⇒ 亲和数2^n(3⋅2^{n-1}-1)(3⋅2^n-1), 2^n(9⋅2^{2n-1}-1)'])),
			'已知符合上述亲和数条件的$n$有：2，4，7',
			'素数$p$都是Thabit素数(底数$b=p$)'
		])],

	['第2类Thabit素数____第2类321素数',ksc(kxA(['素数满足形式：3⋅2^n+1'])),'',
		'7,13,97,193,769,12289,786433,3221225473,206158430209,6597069766657,221360928884514619393,⋯'.split(',').join(br),
		ul(['素数$p>3$都是第2类Thabit素数(底数$b=p-2$)'
		])],



	['Mills素数',['素数满足形式：'+ksc(zp(msups(['A',3,'n'],''),'⌊⌋')),
			'其中Mills常数$A$未知',
			'如黎曼假设成立','$A≈1.3063778838630806904686144926$'].join(br),
		'',
		'如黎曼假设成立：,2,11,1361,2521008887,16022236204009_,818131831320183,41131011492151_,04800030529537_,91595317048613_,96235397599331_,35949994882770_,404074832568499'.split(',').join(br),
		ul(['',
			ol(['A是否无理数？'],'unknown')
		])
		],




],'TBrc').replace(/____/g,br))+




detail('素数（按数位特征）',Table([ZLR('名称 定义(满足条件) 第n项 前n项 性质')],[

	['重1素数____Repunit',['数位全为1的素数','素数满足形式：'+ksc(frac('10^n-1',9,'')),'位数是素数（必要条件）',''].join(br),'',
			zlr('R','2 19 23 317 1031 49081 86453 109297',',').split(',').join(br),
		ul(['',
			href(Hs+'books.google.com.hk/books?id=YZDhBQAAQBAJ&pg=PA49&lpg=PA49&dq=11111111111111111+factors&source=bl&ots=69t7mL65E1&sig=CZTccVwait54pNcNZb6Hetbt_iQ&hl=en&sa=X&redir_esc=y#v=onepage&q=11111111111111111%20factors&f=false','更多结论'),
			ol(['是否无限多？'],'unknown')
		])
		],

	['置换素数____permutable____anagrammatic____absolute',['数位置换后仍为素数'].join(br),'',
		'等价类：,2,3,5,7,11,13,17,37,79,113,199,337,R19(19个1),R23,R317,R1031'.split(',').join(br),
		ul(['Repunit素数是其中一种典型情况',
			'大于10时，数位只能在1,3,7,9这4个数字中选，且不同数字不超过2个',
			'位数介于3到$6·10^{175}$之间时，都是Repunit素数',
		]),
		ol(['其他未知的置换素数都是Repunit素数？'],'unknown')
		],

	['循环素数____Circular',['数位循环置换后仍为素数',''].join(br),'',
		'等价类：2,3,5,7,11,13,17,37,79,113,197,199,337,1193,3779,11939,19937,193939,199933,R19,R23,R317,R1031,R49081,R86453,R109297,R270343'.split(',').join(br),
		ul(['置换素数（条件更强）是循环素数（条件更弱）的特殊情况',
		])
		],

	['Primeval素数',['数位置换后得到素数个数大于____比其小的数得到的个数',''].join(br),'',
		'2,13,37,107,113,137,1013,1237,1367,10079,10139,12379,13679,100279,100379,123479,1001237,1002347,1003679,1012379,⋯'.split(',').join(br),
		ul(['',
		])
		],


	['极小素数____Minimal',['数位子序列不含素数',''].join(br),'',
		'2,3,5,7,11,19,41,61,89,409,449,499,881,991,6469,6949,9001,9049,9649,9949,60649,666649,946669,60000049,66000049,66600049'.split(',').join(br),
		ul(['',
		])
		],

	['Strobogrammatic素数',['数位旋转180度相同（中心对称，69互为对称）',''].join(br),'',
		'11,101,181,619,16091,18181,19861,61819,116911,119611,160091,169691,191161,196961,686989,688889,⋯'.split(',').join(br),
		ul(['',
		])
		],

	['Emirp素数',['数位逆序后仍为素数','因prime英文字母逆序得名'].join(br),'',
		'13,17,31,37,71,73,79,97,107,113,149,157,167,179,199,311,337,347,359,389,701,709,733,739,743,751,761,769,907,937,941,953,967,971,983,991,⋯'.split(',').join(br),
		ul(['',
		])
		],

	['Weakly素数',['数位任一位变化后不是素数','因脆弱得名'].join(br),'',
		'294001,505447,584141,604171,971767,1062599,1282529,1524181,2017963,2474431,2690201,3085553,3326489,4393139,⋯'.split(',').join(br),
		ul(['',
		])
		],

	['Smarandache素数',['前n个数拼写连接而成'].join(br),'',
		''.split(',').join(br),
		ul(['前20万个Smarandache数都不是素数',
		]),
		ol(['猜想有无穷多Smarandache素数，虽然至2016年未找到1个'],'unknown')
		],
		
	['Smarandache–Wellin素数',['前n个素数拼写连接而成'].join(br),'',
		'2,23,2357,⋯,只写成以最后1个素数结尾：,2,3,7,719,1033,2297,3037,11927,⋯,'.split(',').join(br),
		ul(['',
		])],


	['高兴素数____Happy',['反复求各数位平方和，最终得到1'].join(br),'',
		'7,13,19,23,31,79,97,103,109,139,167,193,239,263,293,313,331,367,379,383,397,409,487,⋯,'.split(',').join(br),
		ul(['',
		])],


	['双面素数____Dihedral',['按数码显示（7段显示）时，镜像或颠倒后仍是素数'].join(br),'',
		'2,5,11,101,181,1181,1811,18181,108881,110881,118081,120121,121021,121151,150151,151051,151121,180181,180811,181081,⋯,'.split(',').join(br),
		ul(['不含数字6,9的Strobogrammatic素数是双面素数',
			'如有无限多的Repunit素数 $⇒$ 有无限多的双面素数',
			ol(['是否无限多？'],'unknown')
		])],

	['回文素数____Palindromic____Palprime',['是回文数'].join(br),'',
		'2,3,5,7,11,101,131,151,181,191,313,353,373,383,727,757,787,797,919,929,⋯,'.split(',').join(br),
		ul(['除11之外，所有回文素数的位数必是奇数',
			ol(['是否无限多？'],'unknown')
		])],

	['野兽回文素数____Beastly Palindromic',['是回文数','中间数是666'].join(br),'',
		'700666007,100000000000006_,6600000000000001,即Belphegor素数,⋯,'.split(',').join(br),
		ul([''
		])],

	['三重回文素数____Triply Palindromic',['是回文数','位数以及位数的位数都是回文素数'].join(br),'',
		'10000500001,⋯,'.split(',').join(br),
		ul([''
		])],


	['可截短素数____nTruncatable',['数位不含0，且从左（或右）截去任意位后仍为素数','不能再扩充数位长度保持是素数的，称为受限的'].join(br),'',
		('左可截(4260个):,2,3,5,7,13,17,23,37,43,47,53,67,73,83,97,113,137,167,173,197,223,283,313,317,337,347,353,367,373,383,397,443,467,523,547,613,617,643,647,653,673,683,743,773,797,823,853,883,937,947,953,967,983,997,⋯,357686312646_,216567629137,'+
		'右可截(83个):,2,3,5,7,23,29,31,37,53,59,71,73,79,233,239,293,311,313,317,373,379,593,599,719,733,739,797,2333,2339,2393,2399,2939,3119,3137,3733,3739,3793,3797,5939,7193,7331,7333,7393,23333,23339,23399,23993,29399,31193,31379,37337,37339,37397,59393,59399,71933,73331,73939,233993,239933,293999,373379,373393,593933,593993,719333,739391,739393,739397,739399,2339933,2399333,2939999,3733799,5939333,7393913,7393931,7393933,23399339,29399999,37337999,59393339,73939133,'+
		'左右可截(15个):,2,3,5,7,23,37,53,73,313,317,373,797,3137,3797,739397,'+
		'受限左可截(1442个):,2,5,773,3373,3947,4643,5113,6397,6967,7937,15647,16823,24373,33547,34337,37643,56983,57853,59743,62383,63347,63617,69337,72467,72617,75653,76367,87643,92683,97883,98317,'+
		'受限右可截(27个):,53,317,599,797,2393,3793,3797,7331,23333,23339,31193,31379,37397,73331,373393,593993,719333,739397,739399,2399333,7393931,7393933,23399339,29399999,37337999,59393339,73939133'
		).split(',').join(br),
		ul([''
		]),
		],
],'TBrc').replace(/____/g,br))+




detail('素数（按与其余素数的关系）',Table([ZLR('名称 定义(满足条件) 第n项 前n项 性质')],[

	['强素数____Strong',['大于与之相邻两素数算术平均数',''].join(br),'',
		'11,17,29,37,41,59,67,71,79,97,101,107,127,137,149,163,179,191,197,223,227,239,251,269,277,281,307,311,331,347,367,379,397,419,431,439,457,461,479,487,499,⋯'.split(',').join(br),
		ul(['$孪生素数(p>5,p+2)中，p是强素数$',
		])
		],
	['弱素数____Weak',['小于与之相邻两素数算术平均数',''].join(br),'',
		'3,7,13,19,23,31,⋯'.split(',').join(br),
		ul(['$孪生素数(p>5,p+2)中，p+2是弱素数$',
		])
		],
	['平衡素数____Balanced',['等于与之相邻两素数算术平均数',''].join(br),'',
		'5,53,157,173,211,257,263,373,563,593,607,653,733,947,977,1103,⋯'.split(',').join(br),
		ul(['',
		]),
		ol(['是否有无穷多平衡素数？'],'unknown')
		],


	['唯一素数____Unique',kxA(['1/p循环节长度≠任何其他素数得到的长度','']),'',
		'3,11,37,101,9091,9901,333667,⋯'.split(',').join(br),
		ul(['',
		]),
		],


	['幸运素数____Lucky',kxA(['正整数列反复筛除','第k次筛除数列中编号是k+1倍数的数','与素数筛不同之处在于：','按序号而不是按数值剔除']),'',
		'3,7,13,31,37,43,67,73,79,127,151,163,193,⋯,'.split(',').join(br),
		ul(['',
			ol(['是否无限多？'],'unknown')
		])],


	['Stern素数',['无法写成1个比其小的素数与一个完全平方数的2倍之和'].join(br),'',
		'2,3,17,137,227,977,1187,1493,⋯,'.split(',').join(br),
		ul([''
		])],



	['好素数____Good','p_n^2 > p_{n+i}p_{n-i}','',
		'5,11,17,29,37,41,53,59,67,71,97,101,127,149,⋯,'.split(',').join(br),
		ul(['',
		])],

	['超素数____Super____Higher order____Prime-indexed',['在素数数列中序号(编号从1开始)是素数'].join(br),'',
		'3,5,11,17,31,41,59,67,83,109,127,157,179,191,211,241,277,283,331,353,367,401,431,461,509,547,563,587,599,617,709,739,773,797,859,877,919,967,991,⋯,'.split(',').join(br),
		ul(['大于96的整数都可以被表示成若干个超素数之和（Dressler & Parker 1975）',
			'还可以定义更高阶的超素数'
		])],


	['Higgs素数',[].join(br),'',
		',⋯,'.split(',').join(br),
		ul(['',
		])],

	['Supersingular素数',[].join(br),'',
		',⋯,'.split(',').join(br),	//6174
		ul(['',
		])],


		
		
		
],'TBrc').replace(/____/g,br))
);