/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Relation Type']=Kx(


detail('关系类型',Table([ZLR('名称 记法 定义 关系矩阵 关系图 性质')],[
	
	ZLR('A到B的二元关系____R____'+kxA(['A×B的子集','前域A','陪域B','定义域D(R)','值域R(R)'])+'____'+kxA(['关系矩阵M','布尔矩阵'])+'____关系图G____','','____'),
		
	ZLR('A_1×A_2×⋯×A_n上的n元关系________'+prod('i',1,'n','A_i',2,'')+'的子集','','____'),
		
	ZLR('A上的n元关系________A^n的子集________','','____'),

	ZLR('自反\nReflexive________∀x(x∈A → xRx)____主对角线都是1____含全部自回路____'+
		kxA(['R自反 ⇔ '+piece(['\\widetilde R、s(R)自反',kxo('R')+'反自反','r(R) = R']),
		'R自反 ⇒ '+piece(['t(R)自反'])]),'','____'),
		
	ZLR('反自反\nIrReflexive________∀x(x∈A → x'+kxo('R')+'x)____主对角线都是0____无自回路____'+
		'R反自反 ⇔ '+piece(['\\widetilde R反自反',kxo('R')+'自反']),'','____'),
		
	ZLR('对称\nSymmetric________∀x∀y(x,y∈A ∧ xRy → yRx)____对称矩阵____有a到b的弧 → 有b到a的弧____'+
		'R对称 ⇔ '+piece(['\\widetilde R、r(R)、'+kxo('R')+'对称','\\widetilde R = s(R) = R']),'','____'),
		
	ZLR('反对称\nAntiSymmetric________∀x∀y(x,y∈A ∧ xRy ∧ yRx  → x=y)____a_{ij}=1 → a_{ji}=0____'+khrA(['有a到b的弧 → 无b到a的弧','任意两点之间无双向弧'])+'____'+
		'R反对称 ⇔ '+piece(['\\widetilde R反对称',kxo('R')+'完全']),'','____'),
		
	ZLR('传递\nTransitive________∀x∀y∀z(x,y,z∈A ∧ xRy ∧ yRz  → xRz)____无简单直观特点____有a到b的有向路径 → 有a到b的弧____'+
		'R传递 ⇔ '+piece(['\\widetilde R传递','t(R) = R']),'','____'),
		
	ZLR('循环\nCirculate________∀x∀y∀z(x,y,z∈A ∧ xRy ∧ yRz  → zRx)________路径长度大于1则形成环____','','____'),

	ZLR('完全\n可比comparable________'+kxA(['∀x∀y(x,y∈A → xRy ∨ yRx)',ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - - - -')])])+
		'____主对角线两侧\\\\ 的对称元素不全为0____任意两点之间必有弧____'+
		'R完全 ⇔ '+piece(['\\widetilde R完全',kxo('R')+'反对称','s(R) = 全'])+'____'+
		'R完全 ⇒ '+piece(['R自反'])+'____','','____'),

	ZLR('相容\n________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - ✔ - -')])+'____主对角线都是1\\\\对称矩阵________'+
		kul([piece(['r(相容): 相容','s(相容): 相容','t(相容): 等价']),
		'R相容 ⇔ '+piece(['\\widetilde R相容',kxo('R')+'对称、反自反']),
		]),'','____'),

	ZLR('预序\nPre\n先序________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - - - ✔')])+'____________'+
		kul([piece(['r(预序): 预序','s(预序): 等价','t(预序): 预序'])
		]),'','____'),

	ZLR('等价\nEquivalence________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - ✔ - ✔')])+'________'+kxA(['每一分图是完全图','（每一节点有自回路，','每两节点间有反向的两边）'])+'____'+
		kul([piece(['r(等价): 等价','s(等价): 等价','t(等价): 等价']),
		piece(['R等价','S等价'],1)+' ⇒ '+piece(['R=S ⇔ A/R=A/S'])
		]),'','____'),

	ZLR('拟序\nQuasi________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('- ✔ - - ✔')])+'____________'+
		kul([piece(['r(拟序): 偏序','s(拟序): 拟序','t(拟序): 拟序']),
		'R拟序 ⇔ '+piece(['\\widetilde R拟序','R∩\\widetilde R=∅ ∧ R=R^+']),
		'拟序 '+piece([' < R, < >','< P(A),⊂>','偏序-I'])
		]),'','____'),
		
	ZLR('偏序\nPartial________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - - ✔ ✔')])+'________'+kxA(['哈斯图'+kxf('Hasee'),'只画出覆盖弧','（由下到上，依次变大）'])+'____'+		
		kul([piece(['r(偏序): 偏序','s(偏序): 等价','t(偏序): 偏序']),
		'R偏序 ⇔ '+piece(['\\widetilde R偏序','R∩\\widetilde R=I ∧ R=R^*']),
		'R偏序 ⇒ '+
		'偏序 '+piece(['< I,≤>','< P(A),⊆>','< N,|>','拟序∪I','< 划分族,细分>'])
		]),'','____'),
		
	ZLR('线序\nTotal________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - - ✔ ✔')])+'________'+kxf('Hasee')+'图是一竖立的节点序列____'+
		kul([piece(['r(线序): 线序','s(线序): 等价','t(线序): 线序']),
		'R线序 ⇔ '+piece(['\\widetilde R线序']),
		'偏序 '+piece(['< R,≤>','< R^n,≤>','词典序：按字母表比较'])
		]),'','____'),
		
	ZLR('良序\nWell________'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ - - ✔ ✔')])+'________链____'+
		kul([piece(['r(良序): 良序','s(良序): 等价','t(良序): 良序']),
		'良序 '+piece(['< N,≤>','< N^n,≤>','有限集线序','标准序：按长度和字母表比较'])
		]),'','____'),

	ZLR('空关系____∅____'+ztable([ZLR('自反 反自反 对称 反对称 传递'),[piece([['✔','∅上'],['×','非∅上']])].concat(ZLR('✔ ✔ ✔ ✔'))])+'____零矩阵____零图（孤立节点）____'+
		kul([piece(['r(∅): I','s(∅): ∅','t(∅): ∅']),
		]),'','____'),
		
	ZLR('全域关系________'+kxA([ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ × ✔ × ✔')]),
		prod('i',1,'n','A_i',2,''),'其中n≥1'])+'____全为1的矩阵____有向完全图____'+
		kul([piece(['r(全): 全','s(全): 全','t(全): 全']),
		]),'','____'),
		
	ZLR('相等关系____I____'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('✔ × ✔ ✔ ✔')])+'____单位矩阵I____含且只含全部自回路____'+
		kul([piece(['r(I): I','s(I): I','t(I): I']),
		]),'','____'),
		
	ZLR('不相等关系____≠____'+ztable([ZLR('自反 反自反 对称 反对称 传递'),ZLR('× ✔ ✔ × ×')])+'____1矩阵 - I____无自回路且有其余所有弧____'+
		kul([piece(['r(≠): 全','s(≠): ≠','t(≠): 全']),
		]),'','____'),

	ZLR('合成关系____RS____\\{ < a,c> | aRb ∧ bSc\\}____矩阵乘法____关系R弧1的终点是关系S弧2的起点，\n则弧1起点到弧2终点的弧是合成关系____'+
		kul(['A(B∪C) = AB∪AC ','A(B∩C) ⊆ AB∩AC ','(B∪C)A = BA∪CA ','(B∩C)A ⊆ BA∩CA','(AB)C = A(BC) 可结合但不可交换']),'','____'),
		
	ZLR('关系的幂____R^n____R^0 = I~相等关系\\\\ R^{n+1} = R^nR____矩阵幂____R^n有x到y的弧 \\\\ → R有x到y的路径（长度为n）____'+
		kul(['R^mR^n = R^{m+n}','(R^m)^n = R^{mn}','|A|=n → R^i=R^j \\\\ 且0≤i < j≤ 2^{n^2}']),'','____'),

	ZLR('补关系____'+khrA([kxo('R'),'A×B-R'])+'________布尔矩阵逻辑取反____补图____'+
		kul([
			'\\widetilde {'+kxo('R')+'}='+kxo('\\widetilde R'),
			]),'','____'),

	ZLR('逆关系____'+khrA(['\\widetilde R','R^c'])+'________矩阵转置____逆图____'+
		kul(['\\widetilde {\\widetilde R} = R',
			'\\widetilde {R∪S} = \\widetilde R ∪ \\widetilde S',
			'\\widetilde {R∩S} = \\widetilde R ∩ \\widetilde S',
			'\\widetilde {'+kxo('R')+'}='+kxo('\\widetilde R'),
			'\\widetilde {R-S} = \\widetilde R-\\widetilde S',
			'R⊆S ⇒ \\widetilde R⊆\\widetilde S']),'','____'),

	ZLR('闭包\n________包含R且具有某些性质的最小关系____________'+
		kul(['rs(R) = sr(R)','rt(R) = tr(R)','ts(R) ⊇ st(R)','r(R∪S) = r(R)∪r(S)','s(R∪S) = s(R)∪s(S)','t(R∪S) ⊇ t(R)∪t(S)',
		'R⊇S ⇒ '+piece(['r(R)⊇r(S)','s(R)⊇s(S)','t(R)⊇t(S)']),
		'整数集I上的关系< '+piece(['r( < ): ≤','s( < ): ≠','t( < ):  < ']),
		'整数集I上的关系≤ '+piece(['r(≤): ≤','s(≤): 全域关系','t(≤): ≤'])
		]),'','____'),
	ZLR('自反闭包\n____r(R)____R∪I____M+I____添加自回路____','','____'),

	ZLR('对称闭包\n____s(R)____R∪\\widetilde R____M+M^T____弧“有来有往”____','','____'),
	ZLR('传递闭包\n____'+khrA(['t(R)','R正','R^+'])+'____t(R) = '+piece([['R∪R^2∪⋯ = '+sum('i',1,'∞','R^i',1,''),'无穷集合上'],
			[sum('i',1,'n','R^i',1,''),'有限集合上']])+'____'+
			sum('i',1,'∞','M^i','','')+'________'+
		kul(['(R^+)^+=R^+']),'','____'),
	ZLR('自反传递闭包\n____'+khrA(['R星','R^*'])+'____tr(R)____________'+
		kul(['(R^*)^* = R^*','RR^* = R^*R = R^+']),'','____'),
	ZLR('自反对称传递闭包\n____R\'____tsr(R)\\\\ R诱导的等价关系____','','____')



],'wiki').replace(/\n/g,br))+
	
detail('关系比较',Table([ZLR('关系\n$R$ 自反\nreflexive 反自反\nirreflexive 对称\nsymmetric 反对称\nantisymmetric 传递\ntransitive').concat(
		['逆关系\n$\\widetilde R$','补关系\n$'+kxo('R')+'$','自反闭包\n$r(R)$','对称闭包\n$s(R)$','传递闭包\n$t(R)$',
		'自反对称闭包\n$rs(R)=sr(R)$','自反传递闭包\n$R星、R^*、tr(R)=rt(R)$','传递对称闭包\n$ts(R)=sts(R)$','对称传递闭包\n$st(R)$',
		'自反对称传递闭包\n$R\'、tsr(R)$'])],[
	['相容','自反','×','对称','-','-','相容','对称、反自反','相容','相容','等价','','','','','']

],'wiki').replace(/\n/g,br))+
	
detail('关系类型（图示）',DCtv('plot',
	'nodesXY("test","  trigSolid",{"n":[["等价"],["相容","预序","拟序"],["循环","对称","自反","传递","反对称","反自反"],["完全","偏序"],["非空子集有最小元","线序(全序，简单序，链)"],["良序"]],"nt":[[5,1,-110,0]]},[[[1,1],[2,1]],[[1,1],[2,2]],[[1,1],[3,1],"line dotted trigSolid"],[[1,1],[3,3],"line dotted trigSolid"],[[2,2],[3,3]],[[2,2],[3,4]],[[2,3],[3,4]],[[2,3],[3,5]],[[2,3],[3,6]],[[2,1],[3,2]],[[2,1],[3,3]],[[4,1],[3,3]],[[4,2],[3,3]],[[4,2],[3,4]],[[4,2],[3,5]],[[5,2],[4,2]],[[5,2],[4,1]],[[6,1],[5,2]],[[6,1],[5,1]],],"  s s",[0,0,2,0,0,0,0,0,0,20],"60 80","","r=2","",[[1,1,"","cx=-30"]])'

))
);