/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Equivalence']=Kx(

detail('等价关系',Table([ZLR('名称 记法 定义 性质')],[
	
	ZLR('等价类____[a]____子集（任意两元素满足等价关系）____'+kul(['aRb ⇔ [a]=[b]',
		'R等价 ⇒ [a]=[b] 或 [a]∩[b]=∅（2必选1）']),'','____'),
	ZLR('覆盖____π____'+khrA(['子集族\\{A_1,A_2,⋯,A_m\\}','A='+sum('i',1,'m','A_i',1,'')]),'','____'),
	ZLR('划分____π____'+khrA(['子集族\\{A_1,A_2,⋯,A_m\\}是覆盖','A_i∩A_j=∅ 或A_i=A_j'])+'____'+
		'划分 ⇔ 与等价关系一一对应','','____'),
	ZLR('秩________等价类的个数（划分的块数）','','____'),
	ZLR('商集____'+khrA(['A/R','A模R'])+'____等价关系R的划分','','____'),
	ZLR('细分________划分π_1的每一块\\\\ 都包含于⊆划分π_2的一块中____'+kul(['π_1细分π_2 ⇔ R_1⊆R_2','<划分族,细分>是偏序']),'','____'),
	ZLR('划分的积____π_1⋅π_2____细分划分π_1π_2的最小划分____','','____')

],'wiki').replace(/\n/g,br))
);