/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Unit']=Kx(

	detail('数量级',Table([ZLR('数量级 中文 梵语 英文（美） 英文（英）')],[
		['10^{-24}','[幺]','涅盘寂静','',''],
		['10^{-21}','[仄]','清净','',''],
		['10^{-20}','','虚空','',''],
		['10^{-19}','','六德','',''],
		['10^{-18}','[阿]','刹那','',''],
		['10^{-17}','','弹指','',''],
		['10^{-16}','','瞬息','',''],
		['10^{-15}','[飞]','须臾','',''],
		['10^{-14}','','逡巡','',''],
		['10^{-13}','','模糊','',''],
		['10^{-12}','漠[皮]','','',''],
		['10^{-11}','渺','','',''],
		['10^{-10}','埃','','',''],
		['10^{-9}','尘[纳]','','',''],
		['10^{-8}','沙','','',''],
		['10^{-7}','纤','','',''],
		['10^{-6}','[微]','','',''],
		['10^{-5}','忽','','',''],
		['10^{-4}','丝','','',''],
		['10^{-3}','[毫]','','',''],
		['10^{-2}','[厘]','','',''],
		['10^{-1}','[分]','','',''],

		['10^{0}','个','','one','='],
		['10^{1}','十','','ten','='],
		['10^{2}','百','','hundred','='],
		['10^{3}','千','','thousand','='],
		['10^{4}','万','','ten thousand','='],
		['10^{5}','十万','','hundred thousand','='],
		['10^{6}','百万[兆]','','million','='],
		['10^{7}','千万','','ten million','='],
		['10^{8}','亿','','hundred million','='],
		['10^{9}','十亿[吉]','','billion','thousand million'],
		['10^{10}','百亿','','ten billion','ten thousand million'],
		['10^{11}','千亿','','hundred billion','hundred thousand million'],
		['10^{12}','万亿【兆】[太]','','trillion','billion'],
		['10^{13}','十兆','','ten trillion','ten billion'],
		['10^{14}','百兆','','hundred trillion','hundred billion'],
		['10^{15}','千兆[拍]','','quadrillion','thousand billion'],
		['10^{16}','【京】','','ten quadrillion','ten thousand billion'],
		['10^{17}','十京','','hundred quadrillion','hundred thousand billion'],
		['10^{18}','百京[艾]','','quintillion','trillion'],
		['10^{19}','千京','','ten quintillion','ten trillion'],
		['10^{20}','【垓】','','hundred quintillion','hundred trillion'],
		['10^{21}','十垓[泽]','','sextillion','quadrillion'],
	//	ZLR('-',10),
		['10^{24}','【秭】[尧]','','septillion',''],

		['10^{27}','千秭','','octillion',''],
		['10^{28}','【穰】','','',''],


		['10^{30}','百穰','','nonillion',''],

		['10^{32}','【沟】','','',''],
		['10^{33}','十沟','','decillion',''],

		['10^{36}','【涧】','','undecillion',''],

		['10^{39}','千涧','','duodecillion',''],
		['10^{40}','【正】','','',''],



		['10^{42}','百正','','tredecillion',''],

		['10^{44}','【载】','','',''],
		['10^{45}','十载','','quattuordecillion',''],

		['10^{48}','【极】','','quindecillion',''],

		['10^{51}','千极','','sexdecillion',''],
		['10^{52}','','【恒河沙】','',''],

		['10^{54}','','百恒河沙','septendecillion',''],

		['10^{56}','','【阿僧祇qí】\nasamkya','',''],
		['10^{57}','','十阿僧祇','octodecillion',''],

		['10^{60}','','【那由他】','novemdecillion',''],

		['10^{63}','','千那由他','vigintillion',''],
		['10^{64}','','【不可思议】','',''],

		['10^{66}','','百不可思议','tredecillion',''],

		['10^{68}','','【无量】','',''],
		['10^{69}','','十无量','quattuordecillion',''],

		['10^{72}','','【大数】','tredecillion',''],

		['10^{75}','','','',''],
		['10^{76}','','【全仕祥】','',''],

		['10^{100}','','','googol',''],

		['10^{303}','','','centillion',''],
		[msups([10,10,100],''),'','','googolplex','']

	],'wiki')).replace(/____/g,br)+
	
detail('单位换算',[
	
detail('数量级前缀',Table('',[
	ZLR('中文 十 百 千 兆 吉 太 拍 艾 泽 尧'),
	ZLR('英文 deca hecto kilo mega giga tera peta exa zetta yotta'),
	ZLR('符号 da h k M G T P E Z Y'),
	ZLR('数量级 10^1 10^2 10^3 10^6 10^9 10^{12} 10^{15} 10^{18} 10^{21} 10^{24}'),
	ZLR('-',11),
	ZLR('中文 分 厘 毫 微 纳 皮 飞 阿 仄 幺'),
	ZLR('英文 deci centi milli micro nano pico femto atto zepto yocto'),
	ZLR('符号 d c m μ n p f a z y'),
	ZLR('数量级 10^{-1} 10^{-2} 10^{-3} 10^{-6} 10^{-9} 10^{-12} 10^{-15} 10^{-18} 10^{-21} 10^{-24}')
],'wiki').replace(/\n/g,br)),
detail('国际单位制SI基本单位',Table([ZLR('物理量 物理量英文 物理量符号 中文 英文 符号 定义')],[
	ZLR('长度____length____L____米____metre____m____1米是光在真空中1/299792458秒的行程','','____'),
	ZLR('质量____mass____m____千克\n公斤____kilogram____kg____国际千克原器的质量','','____'),
	ZLR('时间____time____t____秒____second____s____1秒是铯-133原子基态两个超精细能级之间跃迁\n所对应的辐射的9192631770周期的持续时间','','____'),
	ZLR('电流____electric current____I____（安）培____ampere____A____真空中相距1米的两根无限长且圆截面可忽略的\n平行直导线内通过一恒定电流，\n当两导线每米长度之间产生的力等于{2×10^{-7}}牛顿时，\n则规定导线中通过的电流为1安培','','____'),
	ZLR('温度____thermodynamic temperature____T\nΘ____（开）尔文____kelvin____K____1开是水三相点热力学温度的'+frac(1,273.16,''),'','____'),
	ZLR('物质的量____amount of substance____n____（摩）尔____mole____mol____1摩是一系统物质的量，所包含的基本单位\n（含有阿伏伽德罗常量（约{6.02×10^{23}}）个）\n与12克碳-12的原子数目相等','','____'),
	ZLR('光强____luminous intensity____I\nJ____（坎）德拉____candela____cd____1坎为一光源在给定方向的发光强度，\n光源发出频率为{540×10^{14}}赫的单色辐射，\n且在此方向上的辐射强度为{'+frac(1,683,'')+'}瓦每球面度','','____')
],'wiki').replace(/\n/g,br)),
detail('SI导出单位（专有名称）',Table([ZLR('物理量 物理量英文 物理量符号 中文 英文 符号 表达式 表达式（用基本单位） 定义')],[
	ZLR('角____angle________弧度____radian____rad________m·m^{-1}____','','____'),
	ZLR('立体角____solid angle________球面度____steradian____sr________m^2·m^{-2}____','','____'),
	ZLR('频率____frequency________（赫）兹____hertz____Hz________s^{-1}____','','____'),
	ZLR('力\n重力____force\nweight________（牛）顿____newton____N________kg·m·s^{-2}____','','____'),
	ZLR('压强\n应力____pressure\nstress________（帕）斯卡____pascal____Pa____N/m^2____kg·m^{-1}·s^{-2}____','','____'),
	ZLR('能量\n功\n热量____energy\nwork\nheat________（焦）耳____joule____J____N·m____kg·m^2·s^{-2}____','','____'),
	ZLR('功率\n辐射通量____power,radiant flux________（瓦）特____watt____W____J/s____kg·m^2·s^{-3}____','','____'),
	ZLR('电量____electric charge\nquantity of electricity________（库）仑____coulomb____C________s·A____','','____'),
	ZLR('电压\n电位差\n电势\n电动势____voltage\nelectrical potential difference\nelectromotive force________（伏）特____volt____V____W/A____kg·m^2·s^{-3}·A^{-1}____','','____'),
	ZLR('电容____electric capacitance________（法）拉____farad____F____C/V____kg^{-1}·m^{-2}·s^4·A^2____','','____'),
	ZLR('电阻\n电抗\n电阻抗____electric resistance\nimpedance\nreactance________（欧）姆____ohm____Ω____V/A____kg·m^2·s^{-3}·A^{-2}____','','____'),
	ZLR('电导____electrical conductance________（西）门子____siemens____S____A/V____kg^{-1}·m^{-2}·s^3·A^2____','','____'),
	ZLR('磁通量____magnetic flux________（韦）伯____weber____Wb____V·s____kg·m^2·s^{-2}·A^{-1}____','','____'),
	ZLR('磁感应强度\n磁通量密度____magnetic flux density________（特）斯拉____tesla____T____Wb/m^2____kg·s^{-2}·A^{-1}____','','____'),
	
	ZLR('电感____inductance________（亨）利____henry____H____Wb/A____kg·m^2·s^{-2}·A^{-2}____','','____'),
	ZLR('温度____temperature____T____摄氏度____coulomb____°C________K____°C=°K-273.15=(°F-32)/1.8','','____'),
	ZLR('________T____华氏度____fahrenheit____°F________K____°F=°K·1.8-459.67=°C·1.8+32','','____'),
	ZLR('光通量____luminous flux________（流）明____lumen____lm____cd·sr____cd____','','____'),
	ZLR('光照度____illuminance________（勒）克斯____lux____lx____lm/m2____m^{-2}·cd____','','____'),
	ZLR('放射性活度____radioactivity\ndecays per second________（贝可）勒尔____becquerel____Bq________'+msup('s-1')+'____每秒发生1次自发核转变或跃迁','','____'),
	ZLR('吸收剂量____absorbed dose________（戈）瑞____gray____Gy____J/kg____m^2·s^{-2}____','','____'),
	ZLR('剂量当量____equivalent dose________（希）沃特____sievert____Sv____J/kg____m^2·s^{-2}____','','____'),
	ZLR('催化活度____catalytic activity________卡塔尔____katal____kat________mol·s^{-1}____每秒催化1mol底物转化的酶量','','____'),
],'wiki').replace(/\n/g,br)),
detail('角 Angle',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[

	ZLR('微秒____microarcsecond____μas____'+frac('π','648 000 000 000','')+'rad____','','____'),
	ZLR('毫秒____milliarcsecond____mas____'+frac('π','648 000 000','')+'rad____1mas = 1000μas','','____'),
	ZLR('秒____second of arc\narcsec\nasec____″____'+frac('π','648 000','')+'rad____1″= 1000mas','','____'),
	ZLR('分____minute of arc\narcmin\namin\nam____′\nMOA____'+frac('π',10800,'')+'rad____1′= 60″','','____'),
	ZLR('角密耳____milliradian____mil\nMRAD____'+frac(1,1000,'')+'rad____','','____'),
	ZLR('梯度（计算器）____gradian\ngrad\ngon____g____'+frac('π',200,'')+'rad____1g = 54′','','____'),
	ZLR('度____degree of arc\narc degree\narcdegree\ndeg____°____'+frac('π',180,'')+'rad____1°= 60′','','____'),
	ZLR('直角____right angle____∟____'+frac('π',2,'')+'rad____1∟ = 90°= 100g','','____'),
	ZLR('圈____turn\nround angle____tr\npla____2πrad____1tr = 4∟ = 360°= 400g','','____'),
],'wiki').replace(/\n/g,br)),
detail('长度 Length',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[

	ZLR('埃____angstrom\nångström____Å____10^{-10}m____1Å = 0.1nm','','____'),
	ZLR('密耳____mil\nthou____mil\nth____0.000 0254m____','','____'),
	ZLR('【毫】____________'+frac(1,'30 000','')+'m ≈ 0.000 033m____'+
		Table('',[ZLR('SI单位 千米 米 分米 厘米 毫米 丝米 忽米 微米'),ZLR('工程单位 公里 公尺 公寸 公分 厘 毫 丝 忽'),ZLR('米 10^3 10^0 10^{-1} 10^{-2} 10^{-3} 10^{-4} 10^{-5} 10^{-6} 10^{-7} 10^{-8}')],'TBrc alignc')+
		SCtv('notes','SI单位与工程单位有区别，勿混淆'),'','____'),
	ZLR('【厘】____________'+frac(1,3000,'')+'m ≈ 0.000 33m____1厘 = 10毫','','____'),
	ZLR('点\n磅（音译）____point____pt____'+frac(127,'360 000')+'m ≈ 0.000 35278m____'+
		Table('',[ZLR('中文字号 八 七 小六 六 小五 五 小四 四 小三 三 小二 二 小一 一 小初 初'),ZLR('点（磅） 5 5.5 6.5 7.5 9 10.5 12 14 15 16 18 22 24 26 36 42')],'TBrc alignc'),'','____'),
	ZLR('【分】____________'+frac(1,300,'')+'m ≈ 0.0033m____1分 = 10厘 = 100毫','','____'),

	ZLR('派卡____pica____pc____'+frac(127,'30 000','')+'m ≈ 0.00423m ____1pc = 12pt','','____'),
	ZLR('英寸____inch____″\nin____0.0254m____1″= 6pc = 72pt = 1000thou(mil)','','____'),
	ZLR('【寸】____________'+frac(1,30,'')+'m ≈ 0.0333m____1寸 = 10分 = 100厘 = 1000毫','','____'),
	ZLR('掌宽____hand____hh\nh____0.1016m____1hh = 4″\n掌宽的小数点后表示英寸数','','____'),
	ZLR('令____link____l.\nli.\nlnk.____0.201168m____1lnk = 7.92″','','____'),
	ZLR('虎口____span____span____0.2286m____1span = 9″','','____'),
	ZLR('光纳秒____light nanosecond________0.299792458m____光在真空中走一纳秒的距离','','____'),
	ZLR('英尺____foot____′\nft____0.3048m____1′= 3hh = 12″','','____'),
	ZLR('【尺】____________'+frac(1,3,'')+'m ≈ 0.3333m____1尺 = 10寸 = 100分 = 1000厘 = 10000毫','','____'),
	ZLR('码____yard____yd____0.9144m____1yd = 3′= 4span = 9hh = 36″','','____'),
	ZLR('拓\n英寻\n浔____fathom____fm\nftm____1.8288m____1fm = 2yd = 6′= 8span = 18hh = 72″','','____'),
	ZLR('【丈】____________'+frac(10,3,'')+'m ≈ 3.3333m____1丈 = 10尺 = 100寸 = 1000分 = 10 000厘 = 100 000毫','','____'),
	ZLR('杆____rod\nperch\npole____rod\nrd____5.0292m____1rod = 2.75fm = 5.5yd = 16.5′= 25lnk = 198″','','____'),
	ZLR('链\n测链____chain____ch____20.1168m____$1ch = 4rod = 100lnk$\n$1ch = 11fm = 22yd = 66′= 88span = 198hh = 792″$','','____'),
	ZLR('【引】____________'+frac(100,3,'')+'m ≈ 33.3333m____1引 = 10丈 = 100尺 = 1000寸 = 10 000分 = 100 000厘 = 1000 000毫','','____'),
	ZLR('锚链____cable____cable____185.2m____','','____'),
	ZLR('弗隆\n浪____furlong____fur____201.168m____$1fur = 10ch = 40rod = 1000lnk$\n$1fur = 110fm = 220yd = 660′= 880span  = 1980hh = 7920″$','','____'),
	
	ZLR('光微秒____light millisecond________299.792458m____光在真空中走一微秒的距离','','____'),
		
	ZLR('【里】____________500m____1里 = 150丈 = 1500尺 = 15000寸 = 150 000分 = 1500 000厘 = 15 000 000毫','','____'),
	ZLR('英里____mile____mi____1609.344m____$1mi = 8fur = 80ch = 320rod = 8000lnk$\n$1mi = 880fm = 1760yd = 5280′ = 15840hh = 63360″$','','____'),
	ZLR('海里____nautical mile____nmi\nnm\nM\nNM____1852m____1nmi = 10cable','','____'),

	ZLR('光毫秒____light millisecond________299792.458m____光在真空中走一毫秒的距离','','____'),

	ZLR('光秒____light second________299792458m____光在真空中走一秒的距离','','____'),
	ZLR('光分____light minute________17987547480m____1光分=60光秒','','____'),
	ZLR('天文单位____astronomical units\nparsec____AU\nau\nua____149597870700m____≈地球与太阳的距离≈500光秒','','____'),
	ZLR('光时____light hour________1079252848800m____1光时=60光分=3600光秒','','____'),
	ZLR('光天____light day________25902068371200m____1光天=24光时=1440光分=86400光秒','','____'),
	ZLR('光周____light week________181314478598400m____1光周=7光天=168光时=10080光分=604800光秒','','____'),
	ZLR('光年____light year____ly____9460730472580800m____光在真空中走一年（儒略年，365.25日）的距离\n1光年=365.25光天=8766光时=525960光分=31557600光秒','','____'),
		
		
	ZLR('秒差距____parallax second\nparsec____pc____m____以地球和太阳距离为底边，视角$π = 1″$的\n恒星与地球的距离$r$为\n$#206264AU（=3.08568×10^16 m = 3.2616 光年）$','','____'),

],'wiki').replace(/\n/g,br)),
detail('面积 Area',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[
	ZLR('平方厘米____square centimeter____cm^2____0.000 1m^2____','','____'),
	ZLR('平方英寸____square inch____in^2____0.000 64516m^2____','','____'),

	ZLR('平方英尺____square foot____ft^2____0.09290304m^2____1ft^2 = 144in^2','','____'),
	ZLR('平方码____square yard____yd^2____0.83612736m^2____1yd^2 = 9ft^2','','____'),

	ZLR('平方米____centiare____$m^2$\n$ca$____1m^2____1m^2 = 10^4cm^2','','____'),
		
	ZLR('平方杆____perch\nsquare rod____perch____25.29285264m^2____1perch = 1rod×1rod = 30.25yd^2 = 272.25ft^2','','____'),

	ZLR('分________分____'+frac(200,3,'')+'m^2 ≈ 66.67m^2____','','____'),
		
	ZLR('公亩____are____$a$\n$dam^2$____100m^2____1a = 1.5分','','____'),
	ZLR('亩________亩____'+frac(2000,3,'')+'m^2 ≈ 666.67m^2____1亩 = 10分','','____'),

	ZLR('十公亩____dectare____daa____1000m^2____1daa = 10a = 1000ca','','____'),

	ZLR('路德____rood____rood____1011.7141056m^2____1rood = 1fur×1rod = 40perch = 1210yd^2','','____'),
	ZLR('英亩____acre____ac____4046.8564224m^2____1ac = 1fur×1ch = 4rood = 160perch = 4840yd^2','','____'),

	ZLR('公顷____hectare____$ha$\n$hm^2$____10 000m^2____$1ha = 15亩 = 150分$\n$1ha = 10daa = 100a$','','____'),
	ZLR('顷________顷____'+frac(200000,3,'')+'m^2 ≈ 66667m^2____1顷 = 100亩 = 1000分','','____'),
	ZLR('平方公里\n平方千米____square kilometre____km^2____1000 000m^2____1km^2 = 100ha = 1000da = 10000a','','____'),

	ZLR('平方英里____square mile____mi^2____2 589 988.110336m^2____1mi^2 = 8fur×80ch = 640ac','','____'),
],'wiki').replace(/\n/g,br)),
detail('体积 Volume',Table([ZLR('中文 英文 符号 表达式 表达式（用基本单位） 定义')],[
	ZLR('【撮】________________0.000 001m^3____','','____'),
	ZLR('【勺】________________0.000 01m^3____1勺 = 10撮','','____'),
	ZLR('立方厘米\n【合】____cubic centimeter____cm^3________0.000 1m^3____','','____'),
	ZLR('立方英寸____cubic inch____in^3________0.000 64516m^3____','','____'),
	
	ZLR('升\n立方分米____litre\ncubic decimetre____$l$\n$L$\n$ltr$\n$dm^3$________0.001m^3____','','____'),

	
	ZLR('加仑（英制）____gallon____$gal$\n$dm^3$________0.00454609m^3____$1英式加仑被定义为华氏62度下10磅重的水的体积$','','____'),
	ZLR('【斗】________________0.01m^3____1斗 = 10升 = 100合 = 1000勺 = 10000撮','','____'),
	
	ZLR('立方英尺____cubic foot____ft^3________0.09290304m^3____1ft^3 = 144in^3','','____'),
	ZLR('【石】________________0.1m^3____1石 = 10斗 = 100升 = 1000合 = 10000勺 = 100000撮','','____'),
		
	ZLR('立方码____cubic yard____yd^3________0.83612736m^3____1yd^3 = 9ft^3','','____'),

	ZLR('立方米____centiare____$m^3$\n$ca$________1m^3____1m^3 = 10^4cm^3','','____'),
		
	ZLR('立方杆____perch\ncubic rod____perch________25.29285264m^3____1perch = 1rod×1rod = 30.25yd^3 = 272.25ft^3','','____'),

	ZLR('分________分________'+frac(200,3,'')+'m^3 ≈ 66.67m^3____','','____'),
		
	ZLR('公亩____are____a\ndam^3________100m^3____1a = 1.5分','','____'),
	ZLR('亩________亩________'+frac(2000,3,'')+'m^3 ≈ 666.67m^3____1亩 = 10分','','____'),

	ZLR('十公亩____dectare____daa________1000m^3____1daa = 10a = 1000ca','','____'),

	ZLR('路德____rood____rood________1011.7141056m^3____1rood = 1fur×1rod = 40perch = 1210yd^3','','____'),
	ZLR('英亩____acre____ac________4046.8564224m^3____1ac = 1fur×1ch = 4rood = 160perch = 4840yd^3','','____'),

	ZLR('公顷____hectare____$ha$\n$hm^3$________10 000m^3____$1ha = 15亩 = 150分$\n$1ha = 10daa = 100a$','','____'),
	ZLR('顷________顷________200000^3m^3 ≈ 66667m^3____1顷 = 100亩 = 1000分','','____'),
	ZLR('立方公里\n立方千米____cubic kilometre____km^3________1000 000m^3____1km^3 = 100ha = 1000da = 10000a','','____'),

	ZLR('立方英里____cubic mile____mi^3________2 589 988.110336m^3____1mi^3 = 8fur×80ch = 640ac','','____'),

],'wiki').replace(/\n/g,br)),
detail('质量 Mass',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[
	ZLR('【分】____________0.0005kg____1分 = 0.5g','','____'),
	ZLR('【钱】____________0.005kg____1钱 = 10分 = 5g','','____'),
	ZLR('【两】____________0.05kg____1两 = 10钱 = 100分 = 50g','','____'),
	ZLR('【斤】____________0.5kg____1斤 = 0.5公斤 = 500g','','____'),
	ZLR('【公斤】____________1kg____1公斤 = 2斤 = 1千克','','____'),
	ZLR('【担】____________50kg____1担 = 100斤','','____'),
	ZLR('吨____ton____T____1000kg____','','____'),
],'wiki').replace(/\n/g,br)),
detail('时间 Time',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[

	ZLR('分____minute____min____60s____1分 = 60秒','','____'),
	ZLR('刻____quater________900s____1刻 = 15分','','____'),
	ZLR('时____hour________3600s____1时 = 4刻 = 60分','','____'),
	ZLR('天\n日____day________86400s____1天（日） = 24时 = 86刻 = 1440分','','____'),
	ZLR('周____week________604800s____1周 = 7天（日） = 168时 = 602刻 = 10080分','','____'),
	ZLR('旬____________864000s____1旬 = 10天（日） = 240时 = 860刻 = 14400分','','____'),
	ZLR('月____month____________1月 = '+piece([['28天','（平年2月）'],['29天','（闰年2月）'],['30天','（4, 6, 9, 11月）'],['31天','（1, 3, 5, 7, 8, 10, 12月）']]),'','____'),
	ZLR('年____year____________1年 = 12月 = '+piece(['365天（平年）','366天（闰年）']),'','____'),
	ZLR('年代____decade____________1年代 = 10年','','____'),
	ZLR('世纪____century____________1世纪 = 10年代 = 100年','','____'),
],'wiki').replace(/\n/g,br)),
detail('速度 Velocity',Table([ZLR('中文 英文 符号 表达式（用基本单位） 定义')],[

	ZLR('米/秒________m/s________','','____'),
	ZLR('千米/时________km/h____'+frac(5,18,'')+'m/s____','','____'),
	ZLR('节________kn____'+frac(463,900,'')+'m/s____1节 = 1海里/时 = 1852m/h','','____'),
],'wiki').replace(/\n/g,br)),
].join(br))
);