/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */


explore['Thinking/Methodology/Dialectic']=


	detail('对立、与正相对、反射、反演',toggler(ZLR('反 负 倒 偏 侧 副 斜 歪 邪 误 不 非 抗 抑 克 畸 补')).join(''), 1)+


	detail('定性、逻辑', toggler2(ZLR('是非 是否 正误 对错 真假 有无 有解,无解 绝对,相对 相关,无关 存在,不存在 唯一,不唯一 确定,不确定 异同 相似,不相似 相等,不相等 等价,不等价 相容,不相容')).join(''), 1)+

	detail('定量、度量、势、量化', toggler2(ZLR('大小 多少 多寡 一多 单多 单双 单复')).join(''), 1)+

	detail('物理量', toggler2(ZLR('长短 高低 高矮 深浅 宽窄 阔窄 广狭 粗细 粗精 稀稠 疏密 亲疏 浓淡 松紧 张弛 钝锐 软硬 厚薄 轻重 强弱 明暗 亮暗 冷热 干湿 净脏 黑白 红绿 模糊,清晰')).join(''), 1)+
	
	detail('物质、生物、生命', toggler2(ZLR('时空 波粒 冰火 水火 门窗 矛盾 草木 根叶 花果 鱼水 鼠猫 老幼 老少 长幼 童叟 阴阳 男女 雌雄 公母 父母 父子 母子 子女 祖孙 生熟 头尾 手足 手脚 生死 生灭 存亡 死活 身心 物质,意识 物质,精神 形神')).join(''), 1)+

	detail('空间、拓扑、几何、位置',toggler2(ZLR('内外 里外 表里 中外 前后 上下 左右 纵横 横竖 顶底 天地 东西 南北 起讫 首尾 首末 本末 曲直 弯直 正歪 直歪 方圆 即离 远近 聚散 连续,离散 零整 整体,局部 整体,部分 全体,个体 公私 偏全 宏观,微观 微著 形影')).join(''),1)+

	detail('状态', toggler2(ZLR('开闭 盈亏 欠余 亏余 盈损 输赢 成败 成功,失败 胜负 止行 动静 静止,运动 变化,不变 变量,不变量 稳定,不稳定 有序,无序 秩序,混沌 周期,非周期 循环,不循环 遍历,非遍历 迭代,非迭代 复合,非复合 完备,不完备')).join(''), 1)+
	
	detail('形势', toggler2(ZLR('起落 升降 涨落 涨跌 遗漏,多余 凹凸 收敛,发散 缩放 屈伸 逆顺 盛衰 兴衰 繁简 利弊 优劣 安危 臧否 否泰 简单,复杂 难易 特殊,一般 特别,普通 稀有,广泛 充分,必要 偶然,必然 直接,间接')).join(''),1)+

	detail('时间、演变',toggler2(ZLR('古今 今昨 今明 早晚 迟早 先后 晨昏 过去,将来 过去,未来 未已 尚未,已经 自至 从到 始终 开始,结束 始末 初末 快慢 缓急 闲忙 新旧 永恒,瞬间 长久,短暂 因果')).join(''),1)+

	
	detail('对偶、二象性、对称、对仗',toggler2(ZLR('过程,结果 行思 质量 态势 定量,定性 现像,本质 主客 主从 主次 主副 主辅 彼此 这那 潜实 潜在,实在 虚实 显隐 道术 世界观,方法论 解证 猜想 理论,实践 文武 文理 理工')).join(''),1)+

	detail('思维',toggler2(ZLR('归纳,演绎 总结,分析 假设,检验 主观,客观 主动,被动 感性,理性')).join(''),1)+

	detail('知觉、感觉',toggler2(ZLR('苦甜 咸甜 咸淡 胖瘦 肥瘦 寒暖 冷暖 饥饱 饿饱 醒睡 醒醉 信疑 忽视,重视 忽略,强调 视听 音频,视频 听觉,视觉')).join(''),1)+

	detail('动作',toggler2(ZLR('分合 开合 张合 分解,合成 进退 加减 增减 增损 增益,损耗 乘除 哭笑 问答 吃拉 喝撒 听说 读写 通堵 疏堵 推拉 断续 施受 舍得 得失 拒迎 接送 迎送 保护,伤害 攻守 攻防 攻击,防御 打击,还击 投降,抵抗 服从,抗拒 拒绝,接受 同意,反对 追躲 追逃 送收 赠送,索取 收放 扩缩 收支 收缴 收交 收发 去留 去回 来回 来去 来往 出入 进出 立躺 站躺 开关 藏露 唱和 学习 学思 赞扬,批评 褒贬')).join(''),1)+

	detail('人性、情感、人文、社会、价值观',toggler2(ZLR('美丑 雅俗 朝野 王蔻 官民 兵将 情理 正邪 善恶 好坏 好孬 巧拙 愚智 勤惰 勤懒 勤劳,懒惰 苦乐 悲乐 悲喜 喜怒 哀乐 祸福 恩怨 恩仇 爱恨 忠奸 贫富 敌友 警匪 主仆 主奴 主体,客体 自他 你我 高尚,卑微 卑亢 骄傲,谦虚 积极,消极 希望,失望')).join(''),1)



/*


	Table([i18(ZLR('Name Author Features'))],[


	],'TBrc')
	*/
;

	
