/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */


explore['Thinking/Methodology/Dialectic']=

	detail('反义词',

	detail('正反：与正相对、反射、反演、逆向、否、毋、非、势不两立',toggler(ZLR('反 负 倒 邪 误 不 非 否 抗 抑 克')).join(''), 1)+
	detail('正补：与正相辅、折射、对偶、助攻、补、侧、次、相得益彰',toggler(ZLR('副 偏 侧 斜 歪 畸 辅 准 次 补 似')).join(''), 1)+

	
	detail('对偶、二象性、对称、对仗、补集',toggler2(ZLR('过程,结果 质量 点面 态势 现像,本质 主客 主从 主次 主副 主辅 长次 潜实 潜在,实在 虚实 显隐 道术 世界观,方法论 理论,实践 文武 文理 理工 波粒')).join(''),1)+

	detail('定性、逻辑', toggler2(ZLR('是非 是否 正误 对错 真假 真伪 有无 有解,无解 绝对,相对 相关,无关 存在,不存在 唯一,不唯一 确定,不确定 定,不定 随机,确定 异同 相似,不相似 相等,不相等 等价,不等价 相容,不相容')).join(''), 1)+

	detail('量、度量、势、量化', toggler2(ZLR('大小 多少 多寡 一多 单多 单双 单复 遗漏,多余 欠余 亏余 盈亏 盈损')).join(''), 1)+

	detail('物理量', toggler2(ZLR('长短 远近 高低 高矮 深浅 宽窄 阔窄 广狭 广窄 广细 粗细 粗精 稀稠 疏密 亲疏 浓淡 松紧 张弛 省费 钝锐 软硬 厚薄 轻重 强弱 刚柔 阴阳 明暗 亮暗 冷热 干湿 净脏 黑白 红绿 模糊,清晰 显隐')).join(''), 1)+
	
	detail('物质、生物、生命、自然', toggler2(ZLR('宇宙 时空 波粒 光影 声光 冰火 水火 水土 水电 水石 山水 地空 海空 海天 天地 乾坤 日月 门窗 矛盾 草木 根叶 花果 鱼水 鼠猫 龙凤 狼狈 生熟 头尾 首尾 首末 本末 手足 手脚')).join(''), 1)+

	detail('空间、拓扑、几何、位置',toggler2(ZLR('内外 里外 表里 中外 前后 上下 左右 纵横 横竖 平直 顶底 东西 南北 起点,终点 凹凸 曲直 弯直 正歪 直歪 方圆 聚散 连续,离散 零整 整体,局部 整体,部分 总分 全体,个体 公私 偏全 宏观,微观 微著 形影')).join(''),1)+

	detail('时间、演变、时节、变化率',toggler2(ZLR('古今 今昨 今明 早晚 迟早 先后 先晚 晨昏 昼夜 宵旦 过去,将来 过去,未来 未已 尚未,已经 自至 从到 起讫 开始,结束 始终 始末 初末 快慢 缓急 闲忙 新旧 永恒,瞬间 长久,短暂 因果 春秋 冬夏 寒暑')).join(''),1)+

	detail('对抗、斗争、竞争、抗争',toggler2(ZLR('抑扬 生克 相克 利害 利弊 保护,伤害 追逃 攻守 攻防 攻击,防御 打挨 打击,还击 投降,抵抗 服从,抗拒 拒绝,接受 拒迎 推就 同意,反对 追躲 追逃')).join(''),1)+

	detail('结果、结论',toggler2(ZLR('输赢 成败 成功,失败 胜利,失利 胜败 胜负 生死 生灭 存亡 死活')).join(''),1)+
	
	detail('形势、趋势', toggler2(ZLR('起落 升降 涨落 涨跌 收敛,发散 逆顺 通堵 畅通,拥堵 连通,断开 断续 断连 疏堵 盛衰 兴衰 优劣 安危 臧否 否泰')).join(''),1)+

	detail('状态', toggler2(ZLR('开关 开闭 开合 离合 分合 张合 即离 止行 动静 静止,运动 变化,不变 变量,不变量 稳定,不稳定 有序,无序 秩序,混沌 周期,非周期 循环,不循环 遍历,非遍历 迭代,非迭代 复合,非复合 完备,不完备')).join(''), 1)+
	

	detail('思维',toggler2(ZLR('归纳,演绎 综合,分析 总结,分析 假设,检验 主观,客观 主动,被动 主体,客体 感性,理性 物质,意识 物质,精神 直接,间接 抽象,具象 抽象,具体 充分,必要 偶然,必然 简单,复杂 繁简 难易 特殊,一般 特别,普通 稀有,广泛 定制,通用 行思 唱和 学习 学思 猜想 解证 论证 定量,定性 等同,近似')).join(''),1)+

	detail('生理、知觉、感觉',toggler2(ZLR('苦甜 咸甜 咸淡 胖瘦 肥瘦 寒暖 冷暖 饥饱 饿饱 醒睡 醒醉 视听 音频,视频 听觉,视觉')).join(''),1)+

	detail('身体行为',toggler2(ZLR('吃拉 喝撒 听说 读写 呼吸')).join(''),1)+

	detail('心理、心情、心态、情绪、情感',toggler2(ZLR('信疑 忽视,重视 忽略,强调 哭笑 苦乐 悲乐 悲喜 喜怒 哀乐 恩威 恩怨 恩仇 爱恨 喜厌 好恶 好坏 好孬 自豪,自卑 卑亢 骄傲,谦虚 积极,消极 希望,失望 身心 形神 情理 放松,紧张 平静,紧张')).join(''),1)+

	detail('运算',toggler2(ZLR('分解,合成 增减 增损 增益,损耗')).join(''),1)+

	detail('人际',toggler2(ZLR('彼此 这那 自他 你我 王蔻 官匪 官民 官兵 兵将 敌友 警匪 主仆 主奴 老幼 老少 长幼 童叟 男女 雌雄 公母 父母 爸妈 爷奶 公婆 父子 母子 子女 祖孙')).join(''),1)+

	detail('动作',toggler2(ZLR('问答 屈伸 进退 请求 请送 推拉 推敲 拔塞 弹拨 招挥 勾搭 施受 舍得 得失 接送 迎送 送收 赠送,索取 缩放 扩缩 摆收 收放 收展 收支 收缴 收交 收发 放肆,收敛 放纵,节制 浪费,节约 去留 去回 来回 来去 来往 出入 进出 立躺 站躺 藏露 隐藏,显露')).join(''),1)+

	detail('人性、人文、人际、社会、价值观',toggler2(ZLR('美丑 帅丑 正邪 正恶 正义,邪恶 忠奸 善恶 雅俗 高雅,庸俗 朝野 巧拙 愚智 笨拙,聪明 糊涂,精明 呆精 勤惰 勤懒 勤劳,懒惰 祸福 贫富 穷富 褒扬,贬低 赞扬,批评 表扬,批评 赏析,批判 欣赏,批斗 鼓励,禁止 感谢,责备 褒贬 包容,排挤 宽容,严格 宽容,严厉 宽严 杰出,平庸 高尚,卑微 尊卑')).join(''),1)
	)+

	detail('数学概念',

	detail('数', toggler2(ZLR('基数,序数 偶数,奇数 整数,分数 整数,小数 有限小数,无限小数 无限循环小数,无限不循环小数 真分数,假分数 带分数,百分数 正数,负数 质数,合数 有理数,无理数 代数数,超越数 实数,虚数 实数,复数 圆周率π,自然常数e 进制,进率')).join(''),1)+
	detail('数组', toggler2(ZLR('勾股数,形数 矩阵,拟阵 向量,张量')).join(''),1)+
	detail('函数', toggler2(ZLR('加减 乘除 和差 积商 相反数,倒数 正比例,反比例 绝对值,? 乘方,开方 幂,根 指数,对数 正弦,余弦 正切,余切 正割,余割 三角函数,反三角函数 指数函数,对数函数 函数,反函数 增函数,减函数 凹函数,凸函数 周期函数,非周期函数 连续函数,非连续函数 可导函数,不可导函数 实变函数,复变函数 泛函,变分 函子,算子 变换,逆变换 导数,反导数 偏导数,偏微分 微分,积分 微分,外微分 定积分,不定积分 交换律,结合律 分配律,因式分解 单位元,逆元 单项式,多项式 群环域,模体格')).join(''),1)+
	detail('方程', toggler2(ZLR('丢番图方程,不定方程 代数方程,超越方程 微分方程,积分方程 常微分方程,偏微分方程 线性方程,非线性方程 齐次,非齐次 有解,无解 特解,通解 近似解,精确解')).join(''),1)+
	detail('集合', toggler2(ZLR('空集,全集 交集,并集 差集,补集 幂集,子集 势,?')).join(''),1)+
	detail('关系', toggler2(ZLR('映射,一一映射 单映射,满映射 自反,反自反 对称,反对称 传递,非传递 相容,不相容 同胚,同伦 同态,同构 同调,?')).join(''),1)+
	detail('几何', toggler2(ZLR('欧氏几何,非欧几何 平面几何,立体几何 射影几何,仿射几何 椭圆几何,双曲几何 解析几何,微分几何 算术几何,代数几何 黎曼几何,张量几何 分形几何,计算几何 点,线 面,体 个数,长度 面积,体积 周长,表面积 相似,全等 直线,曲线 优弧,劣弧 曲率,挠率 平面,曲面 圆,椭圆 正方形,矩形 正方体,长方体 球,椭球')).join(''),1)+
	detail('图论', toggler2(ZLR('欧拉图,哈密尔顿图 欧拉路径,哈密尔顿路径')).join(''),1)
	)

/*


	Table([i18(ZLR('Name Author Features'))],[


	],'TBrc')
	*/
;

	
