/*
 * zzllrr Mather
 * zzllrr@gmail
 * Released under MIT License
 */

wiki['Transcendental']=Kx(

detail('超越数定义与性质',Table([ZLR('名称 定义 性质')],[
	['超越数____transcendental number','不是代数数的实数或复数____不满足有理系数代数方程',ul([
		'超越数都是无理数',
		'超越数集合不可数，与无理数集合、实数集合等势'+scbox('Cantor','brad bold'),
		'超越数可以用有理数有效地逼近',
		'代数数只能很差地被有理数逼近（$n$次代数数的逼近阶至多为$n$）',
		'无理数的逼近阶是$2$',

		])
	]

],'wiki')).replace(/____/g,br)+

detail('下列常数是超越数',Table([ZLR('名称 定义 性质')],[
	['e 自然常数','',scbox('Hermite','brad bold')],
	['π 圆周率','',scbox('Lindemann','brad bold')],
	['通用抛物线常数','$'+kroot(2)+'\\ln (1+'+kroot(2)+')$____$='+kroot(2)+'\\sinh^{-1}1$____$='+kroot(2)+'\\cosh^{-1}'+kroot(2)+'$','抛物线与半圆相比较，类比于圆周率'],
	
	['Gelfond–Schneider常数，Hilbert数','$2^{'+kroot(2)+'}$',scbox('Gelfond–Schneider定理','brad bold')],
	[ksups(kroot(2),2)+'='+kroot('2^{'+kroot(2)+'}'),'',scbox('Gelfond–Schneider定理','brad bold')],
	['Gelfond常数','$e^{π}=(e^{πi})^{-i}=(-1)^{-i}=i^{-2i}$____$23.14069263⋯$',
		scbox('Gelfond–Schneider定理','brad bold')],
	['e^{-π/2}=(-1)^{i/2}=i^i','','或者利用$i=e^{πi/2}$____'+scbox('Gelfond–Schneider定理','brad bold')],

	['实不动点\\cos(x)=x','',scbox('Lindemann–Weierstrass','brad bold')],

	['连分数'+mfracs(copyA(1,6), seqA(1,6).concat('⋱')),'',scbox('Carl Ludwig Siegel','brad bold')],

	['πi，π','',scbox('Lindemann–Weierstrass','brad bold')+'____（根据$e^{πi}=-1$反证，另外$i='+kroot(-1)+'$是无理代数数）'],
	['π + e^π','',''],
	['πe^π','',''],

	['π + \\ln 2 + '+kroot(2)+'ln 3','',''],

	['Γ(1/3), Γ(1/4), Γ(1/6)','',''],
	['Γ(1/4)π^{-1/4}','',''],
		
	['Cahen常数','$0.64341054629⋯$____',''],
	['Champernowne常数','$0.12345678910111213141516⋯$____',''],
	['Chaitin常数','$Ω$','也是不可计算数'],

	['Komornik-Loreti常数','$1.787231650⋯$____',''],
	['Prouhet–Thue–Morse常数','二进制下：$0.01101001100101⋯$____十进制下：$0.4124540336401075977⋯$',''],
	['Thue常数','二进制下：$0.11011011111011011111⋯$____十进制下：$0.8590997969⋯$',''],
	['指数阶乘倒数的级数',ksc(sum('k',1,'+','a_k^{-1}','',''))+'____'+
			'其中$a_0=1, a_n=n^{a_{n-1}}$',''],
	
],'TBrc').replace(/____/g,br))+



detail('下列函数是超越数',Table([ZLR('名称 定义 性质')],[
	['Fredholm数',ksc(sum('k',0,'+',msups(['β','2','n'],''),'',''))+'____其中代数数$β满足：0< |β| < 1$',
		'特例：____'+ksc(sum('k',0,'+',msups([2,'-2','n'],''),'','')+'='+sum('k',0,'+',msups(['(1/2)','2','n'],''),'',''))],
	
	['Liouville数',ksc(sum('k',1,'+','β^{n!}','',''))+'____其中代数数$β满足：0< |β| < 1$',
		'特例：____'+ksc(sum('k',1,'+','10^{-n!}','','')+'='+sum('k',1,'+','(1/10)^{n!}','',''))],
	['Liouville数（推广）','$'+frac('a_1','10!','')+'+'+frac('a_2','10^2!','')+'+'+frac('a_3','10^3!','')+'+⋯$____其中'+
		'$a_i$是任意的个位数但不同时为0',''],
	
	['e^{π'+kroot('n')+'}','其中n是正整数',''],
	
	['a^b','其中代数数a≠0,1，b是无理代数数',scbox('希尔伯特第7问题','brad bold')+'____'+scbox('Gelfond–Schneider定理','brad bold')+
		'____另一种表述：$α≠0,1, 无理数β, α^β$三者中至少一个超越数'],

	['i^{'+kroot('b')+'}','其中b是无理代数数','利用Gelfond–Schneider定理作推论'],

	['a^{'+kroot('b')+'}','其中代数数a≠0,1，b^2不是有理数','利用Gelfond–Schneider定理作推论'],

	['a^{ib}','其中代数数a≠0,1，代数数b','利用Gelfond–Schneider定理作推论'],

	['\\ln a','其中代数数a≠0,1',''],

	['e^a','其中代数数a≠0',scbox('Lindemann–Weierstrass','brad bold')+
		'____另一种表述：$β_1e^{α_1}+⋯+β_ne^{α_n}=0$____'+
		'其中代数数$α_i$互不相同，$β_i$不全为0'+
		'____则$β_i$中至少有一个超越数'+
		'____特别地，$e^ae^0-e^a=0$，得知$e^a$是超越数'],

	['三角函数和双曲函数____$\\sin a$____$\\cos a$____$\\tan a$____$\\csc a$____$\\sec a$____$\\cot a$','其中代数数a≠0,1',scbox('Lindemann–Weierstrass','brad bold')+
		'____注意，三角函数$f(qπ)$（其中$q$是有理数）是代数数'],
	['W(a)','Lambert $W$函数'+br,scbox('Lindemann–Weierstrass','brad bold')],
	
	[frac('\\tan^{-1}a','π',''),'其中有理数a≠0,±1',scbox('Margolius','brad bold')],
		
		
			
	['f(x)','$x$是超越数且$f$是（非常值的）代数函数____（函数满足有理系数多项式方程，即函数是方程的根，____简单而言（但不准确），只涉及加减乘除开n次方运算____(其实还有一些根无法用这些运算表示，根据伽罗瓦理论)）','特例：代数数系数（不全为0）的多项式函数'],

	['a+x, ax','x是超越数且代数数a≠0','反证'],
	['a+ib','实数a,b，至少有一个是超越数','a+ib是代数数⇔实数a,b都是代数数'],
	
	['六指数定理','$e^{ac_1}, e^{ac_2}, e^{ac_3},$ ____'+
		'$e^{bc_1}, e^{bc_2}, e^{bc_3}$中至少有一个超越数____'+
		'其中$a,b$是两个线性无关的复数, $c_i$是三个线性无关的复数',''],


],'TBrc').replace(/____/g,br))+



detail('幂',Table([['$a^b$____其中$a≠0,1; b≠0$','有理数','无理代数数','超越数']],
	[['有理数','代数数','超越数'+scbox('Gelfond–Schneider定理','brad bold'),
		'?猜测一定是超越数____'+
		'?未知是否超越 $2^e$'],
	['无理代数数','代数数','超越数'+scbox('Gelfond–Schneider定理','brad bold')+'____例如：$'+ksups(kroot(2),2)+'=2^{'+kroot(2)+'/2}$',
		'?猜测一定是超越数____'+
		'____例如：$'+ksups(kroot(2),3)+'=2^{'+ksups(kroot(2),2)+'/2}=2^{2^{'+kroot(2)+'/2 - 1}}$'+
		'____例如：$'+kroot(2)+'^π$'],
	['超越数','超越数','可以是代数数：$'+lrp('',ksups(kroot(2),2),'','')+'^{'+kroot(2)+'}=2$____'+
		'可以是超越数：$'+lrp('',ksups(kroot(2),2),'','')+'^{'+kroot(3)+'}=2^{'+kroot(6)+'/2}$____'+
		'?未知是否超越 $π^{'+kroot(2)+'}$',
	
		'可以是代数数：$e^{πi}=-1$____'+
		'可以是超越数：$e^π$____'+
	
		'?未知是否超越 $e^e, '+msups(['e','π',2],'')+'$____'+
		'?未知是否超越 $π^e, π^π$____',
		]
	],'TBrc').replace(/____/g,br)
)+





detail('下列无理数？未知是否超越数',Table([ZLR('名称 定义 性质')],[
	['Apéry常数','$ζ(3)$ ____$1.2020569032⋯$',''],
	
],'TBrc').replace(/____/g,br))+

detail('下列数？未知是否无理数、超越数',Table([ZLR('名称 定义 性质')],[
	['欧拉常数$γ$____Euler–Mascheroni','$0.57721566490153286060651209008240243104215933593992⋯$____'+
		'$'+lim('n','+',lrp('',sum('k',1,'n',frac(1,'k',''),'','')+' - \\ln n','',''),'','')+'$____'+
		'$='+intl(lrp('','-'+frac(1,'x','')+'+'+frac(1,'⌊x⌋',''),'',''),1,'+','','','')+'$',''],
	['Catalan常数G','$0.915965594177219015054603514932384110774⋯$____$\\displaystyle{'+sum('k',0,'+',frac('(-1)^k','(2n+1)^2',''),'','')+'}$____$=β(2)$ Dirichlet $β$函数',
		'类似的一个数'+sum('k',0,'+',frac('(-1)^k','(2n+1)^3',''),'','')+'='+frac('π^3',32,'')],
	['ζ(5), ζ(7), ⋯ ','',''],
	['π + e','',''],
	['π − e','',''],
	['πe','',''],
	['π/e','',''],
	['π^π','',''],
	['e^e','',''],
	['2^e','',''],
	['π^e','',''],
	['π^{'+kroot(2)+'}','',''],
	[msups(['e','π',2],''),'',''],
	['四指数猜想','$e^{ac}$, $e^{ad}$, $e^{bc}$, $e^{bd}$中至少有一个超越数____'+
		'其中$a,b$是两个线性无关的复数, $c,d$是两个线性无关的复数',''],
],'TBrc').replace(/____/g,br))+

detail('特殊常数一览表',Table([ZLR('名称 代数数 超越数')],[

	['γ','','猜测'],
	
	['i='+kroot(-1)+'=e^{πi/2}','√',''],
	['e, π','','√'],
	['i + e, i - e, i + π, i - π','','√'],
	['e + π, e - π','','猜测'],
	['ie, iπ, i/e, i/π, e/i, π/i','','√'],
	['eπ','','猜测'],
	['e/π, π/e','','猜测'],
	
	['i^i','','√'],
	['i^e','','猜测'],
	['i^π','','猜测'],

	['e^{i}=\\cos1+i\\sin1','','√'],
	['e^e','','猜测'],
	['e^π','','√'],

	['π^{i}=\\cos1+i\\sin1','','√'],
	['π^e','','猜测'],
	['π^π','','猜测'],

	['i^{eπ}','','猜测'],
	['e^{iπ}=-1','√',''],
	['π^{ie}','','猜测'],

	['2^i','','√'],
	['2^e','','猜测'],
	['2^π','','猜测'],

	['i'+sup(kroot(2),''),'','√'],
	['e'+sup(kroot(2),''),'','猜测'],
	['π'+sup(kroot(2),''),'','猜测'],


	[msups(['i','i',2],''),'√',''],
	[msups(['i','e',2],''),'','猜测'],
	[msups(['i','π',2],''),'','猜测'],

	[msups(['e','i',2],''),'','√'],
	[msups(['e','e',2],''),'','猜测'],
	[msups(['e','π',2],''),'','猜测'],

	[msups(['π','i',2],''),'','√'],
	[msups(['π','e',2],''),'','猜测'],
	[msups(['π','π',2],''),'','猜测'],


],'TBrc').replace(/____/g,br))+


detail('超越函数一览表',Table([ZLR('名称 例外集（代数数集合，满足函数值也是代数数） 性质')],[



	['e^x','{0}',scbox('Lindemann–Weierstrass','brad bold')],
	['2^x','Q',scbox('Gelfond–Schneider定理','brad bold')+'的一个特例'],
	['x^x','Q\\backslash{0}','推论：下列数是超越数____'+
		'$a^{a}$(其中$a$是无理代数数)____'+
		'$'+ksups(kroot(2),2)+'$____'
		],
	['x'+sup(frac(1,'x',''),''),'Q\\backslash{0}','可以推广的结论：下列数是超越数____'+
		'$'+msups(['a','a','b'],'')+'$(其中$a$是代数数，$b$是无理代数数)____'],

	[msups(['e','e','x'],''),'∅（?猜测）','Schanuel猜想（未获证明）的推论____'+
		'假如猜想成立，则下列数是超越数____'+
		'$'+msups(['e','e','a'],'')+'$（其中$a$是代数数）____'+
		'$e^{e}$____'
		
		
		],
	['e^{1+πx}','∅','推论：'+
		'e^{1+πa}是超越数（其中a是代数数）'
		],

],'TBrc').replace(/____/g,br))

);
	


